## Staging: quicksight
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                    NAME                     |
|--------|---------------------------------------------|
| add    | `aws_quicksight_data_set.sms_usage`         |
|        | `aws_quicksight_refresh_schedule.sms_usage` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_quicksight_data_set.sms_usage will be created
  + resource "aws_quicksight_data_set" "sms_usage" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "sms_usage"
      + id             = (known after apply)
      + import_mode    = "SPICE"
      + name           = "SmsUsage"
      + output_columns = (known after apply)
      + tags_all       = (known after apply)

      + permissions {
          + actions   = [
              + "quicksight:CancelIngestion",
              + "quicksight:CreateIngestion",
              + "quicksight:DeleteDataSet",
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
              + "quicksight:UpdateDataSet",
              + "quicksight:UpdateDataSetPermissions",
            ]
          + principal = "arn:aws:quicksight:ca-central-1:239043911459:group/default/quicksight-dataset-owners"
        }
      + permissions {
          + actions   = [
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
            ]
          + principal = "arn:aws:quicksight:ca-central-1:239043911459:group/default/quicksight-dataset-viewers"
        }

      + physical_table_map {
          + physical_table_map_id = "smsusage"

          + s3_source {
              + data_source_arn = "arn:aws:quicksight:ca-central-1:239043911459:datasource/s3-sms-usage"

              + input_columns {
                  + name = "PublishTimeUTC"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "MessageId"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "MessageType"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "DeliveryStatus"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "PriceInUSD"
                  + type = "DECIMAL"
                }
              + input_columns {
                  + name = "PartNumber"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "TotalParts"
                  + type = "INTEGER"
                }

              + upload_settings {
                  + contains_header = true
                  + delimiter       = ","
                  + format          = "CSV"
                  + start_from_row  = (known after apply)
                  + text_qualifier  = (known after apply)
                }
            }
        }
    }

  # aws_quicksight_refresh_schedule.sms_usage will be created
  + resource "aws_quicksight_refresh_schedule" "sms_usage" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "sms_usage"
      + id             = (known after apply)
      + schedule_id    = "schedule-sms-usage"

      + schedule {
          + refresh_type          = "INCREMENTAL_REFRESH"
          + start_after_date_time = (known after apply)

          + schedule_frequency {
              + interval        = "DAILY"
              + time_of_the_day = "02:30"
              + timezone        = (known after apply)
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-s3-usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_ec2"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_iam"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.vpc_connection_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.jobs"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.login_events"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.notifications"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.organisation"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.services"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.sms_usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.users"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.s3_sms_usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_vpc_connection.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.manifest_file"]

37 tests, 19 passed, 18 warnings, 0 failures, 0 exceptions

```

</details>
